//=============================================================================
//
// フレームワーク
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __MS_FRAMEWORK_H__
#define __MS_FRAMEWORK_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
// アプリケーション
#include "framework/CApp.h"

// ノード
#include "framework/CNode.h"

// シーン
#include "framework/CScene.h"

// レイヤー
#include "framework/CLayer.h"

// スプライト

// ポリゴン

// ビルボード

// モデル

// メッシュ

// スキンメッシュ

#endif  // __MS_FRAMEWORK_H__

// EOF
