//=============================================================================
//
// アプリケーションの独自設定
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __APP_DELEGATE_H__
#define __APP_DELEGATE_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <common/common.h>
#include <string>
#include <framework.h>

//*****************************************************************************
// 前方参照
//*****************************************************************************
class AppDelegate
    : public CApplication
{
public:

    AppDelegate();
    virtual ~AppDelegate();

    virtual bool Init();

    virtual void Release();

private:

};

#endif  // __APP_DELEGATE_H__

// EOF
