//=============================================================================
//
// フォントインターフェース
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __FONT_INTERFACE_H__
#define __FONT_INTERFACE_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <common/DirectX.h>
#include "FontDesc.h"

//*****************************************************************************
// フォントインターフェース
//*****************************************************************************
class IFont
{
public:

    /**
    * フォントの描画
    * @param rect 描画範囲
    * @param pString 文字列
    */
    virtual void Draw(RECT& rect, cs8* pString) = 0;

protected:

    virtual ~IFont(){}
};

#endif  // __FONT_INTERFACE_H__

// EOF
