//=============================================================================
//
// リファレンスカウンタ
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __REF_H__
#define __REF_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
// uncopyable
#include "CUncopyable.h"

//*****************************************************************************
// リファレンスカウンタクラス
//*****************************************************************************
class CRef
    : private CUncopyable
{
public:

    virtual ~CRef() = 0;

    // カウントダウン
    void Decrement();
    
    // カウントアップ
    void Increment();

    int GetReferenceCount();

protected:

    CRef();

private:

    int m_nCounter;
};

#endif    // __REF_H__

// EOF
