//=============================================================================
//
// ハードウェアタイマー
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __HARDWARE_TIMER_H__
#define __HARDWARE_TIMER_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include <common/common.h>

//*****************************************************************************
// ライブラリリンク
//*****************************************************************************
#pragma comment (lib, "winmm.lib")    // これが無いとtime~関数が使えない


//*****************************************************************************
// ハードウェアタイマー
//*****************************************************************************
class CHardwareTimer
{
private:

    /**
    * コンストラクタ
    */
    CHardwareTimer();

    /**
    * デストラクタ
    */
    ~CHardwareTimer();

public:

    /**
    * 生成
    * @ret ハードウェアタイマーインスタンス
    */
    static CHardwareTimer* Create();
    
    /**
    * 開放
    */
    void Release();

    /**
    * 開始時刻設定
    * @ret 現在の時刻
    */
    DWORD Start();

    /**
    * 終了時刻設定
    * @ret 現在の時刻
    */
    DWORD End();

    /**
    * 開始時刻と終了時刻と差分時間からスリープ
    * @ret 終了開始の差分時刻を取得
    * @param diff スリープしたい時間
    */
    DWORD Sleep(DWORD diff);

private:

    // 開始時刻
    DWORD m_uStart;
    // 終了時刻
    DWORD m_uEnd;
};

#endif  // __HARDWARE_TIMER_H__

// EOF
