//=============================================================================
//
// リソース
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __LOST_RESOURCE_H__
#define __LOST_RESOURCE_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <common/DirectX.h>
#include <common/CRef.h>

//*****************************************************************************
// 前方参照
//*****************************************************************************
class CDeviceHolder;

//*****************************************************************************
// リソースクラス
//*****************************************************************************
class CLostResource
    : public CRef
{
public:

    /**
    * リソースの強制的な削除
    */
    virtual void CleanUp() = 0;

    /**
    * リソース情報の保存
    */
    virtual void Restore() = 0;

    /**
    * リソース情報の再読み込み
    */
    virtual void Reload(CDeviceHolder* pHolder) = 0;

protected:

    virtual ~CLostResource(){}
};

#endif  // __LOST_RESOURCE_H__

// EOF
