//=============================================================================
//
// デバッグインターフェース
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __DEBUG_INTERFACE_H__
#define __DEBUG_INTERFACE_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "common.h"

//*****************************************************************************
// デバッグインターフェース
//*****************************************************************************
class IDebug
{
public:

    /**
    * デバッグ文字列送出
    * @param str 文字列フォーマット
    * @param ... フォーマット引数
    */
    virtual void Print(cs8* str, ...) = 0;

    /**
    * デバッグ表示
    */
    virtual void Show() = 0;

    /**
    * デバッグ非表示
    */
    virtual void Hide() = 0;

protected:

    virtual ~IDebug(){}
};

#endif  // __DEBUG_INTERFACE_H__

// EOF
