//=============================================================================
//
// 入力マネージャーインターフェース
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __INPUT_MANAGER_INTERFACE_H__
#define __INPUT_MANAGER_INTERFACE_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "IKeyboard.h"
#include "IMouse.h"

//*****************************************************************************
// 入力マネージャーインターフェース
//*****************************************************************************
class IInputManager
{
public:

    /**
    * キーボード取得
    * @ret キーボード
    */
    virtual IKeyboard* GetKeyboard() const = 0;

    /**
    * マウス取得
    * @ret マウス
    */
    virtual IMouse* GetMouse() const = 0;

protected:

    virtual ~IInputManager(){}
};

#endif  // __INPUT_MANAGER_INTERFACE_H__

// EOF
