//=============================================================================
//
// リソースホルダー
// Author : Ryo Kobayashi
//
//=============================================================================
#pragma once
#ifndef __RESOURCE_HOLDER_H__
#define __RESOURCE_HOLDER_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "IResource.h"

//*****************************************************************************
// リソースホルダークラス
//*****************************************************************************
class CResourceHolder
{
public:

    static void SetResource(IResource* pRes);

    static IResource* GetResource();

private:

    static IResource* m_spRes;
};

#endif  // __RESOURCE_HOLDER_H__

// EOF
